"""
Задача №41
================================================
Дан массив, состоящий из целых чисел. Напишите
программу, которая в данном массиве определит
количество элементов, у которых два соседних и, при
этом, оба соседних элемента меньше данного. Сначала
вводится число N — количество элементов в массиве
Далее записаны N чисел — элементы массива. Массив
состоит из целых чисел.
================================================
Input: 
5
1 2 3 4 5  
Output: 0
=============
Input: 
5
1 5 1 5 1  
Output: 2
"""

